CREATE DATABASE  IF NOT EXISTS `avi_crm` /*!40100 DEFAULT CHARACTER SET utf8 */;
USE `avi_crm`;
-- MySQL dump 10.13  Distrib 5.7.12, for Win64 (x86_64)
--
-- Host: localhost    Database: avi_crm
-- ------------------------------------------------------
-- Server version	5.7.17-log

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `transaction_records_warehouse`
--

DROP TABLE IF EXISTS `transaction_records_warehouse`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `transaction_records_warehouse` (
  `Id` int(11) NOT NULL AUTO_INCREMENT,
  `Article_Parametr_Id` int(11) NOT NULL,
  `Date` date NOT NULL,
  `Balance` int(11) NOT NULL,
  `Note` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`Id`),
  KEY `FK_T_R_W_1_idx` (`Article_Parametr_Id`),
  CONSTRAINT `FK_T_R_W_1` FOREIGN KEY (`Article_Parametr_Id`) REFERENCES `product_article_warehouse` (`Id`) ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=197 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `transaction_records_warehouse`
--

LOCK TABLES `transaction_records_warehouse` WRITE;
/*!40000 ALTER TABLE `transaction_records_warehouse` DISABLE KEYS */;
INSERT INTO `transaction_records_warehouse` VALUES (28,53,'2017-01-23',153,'Крой №27 Пачка №1 - Принята пачка'),(39,53,'2017-01-24',-580,'Заказ 1 - отгружен'),(40,54,'2017-01-24',-790,'Заказ 1 - отгружен'),(41,55,'2017-01-24',-680,'Заказ 1 - отгружен'),(42,56,'2017-01-24',-620,'Заказ 1 - отгружен'),(43,57,'2017-01-24',-900,'Заказ 1 - отгружен'),(44,51,'2017-01-24',-220,'Заказ 1 - отгружен'),(45,48,'2017-01-24',-120,'Заказ 1 - отгружен'),(46,49,'2017-01-24',-110,'Заказ 1 - отгружен'),(47,50,'2017-01-24',-300,'Заказ 1 - отгружен'),(48,52,'2017-01-24',-240,'Заказ 1 - отгружен'),(49,53,'2017-01-24',580,'Заказ 1 - отменен'),(50,54,'2017-01-24',790,'Заказ 1 - отменен'),(51,55,'2017-01-24',680,'Заказ 1 - отменен'),(52,56,'2017-01-24',620,'Заказ 1 - отменен'),(53,57,'2017-01-24',900,'Заказ 1 - отменен'),(54,51,'2017-01-24',220,'Заказ 1 - отменен'),(55,48,'2017-01-24',120,'Заказ 1 - отменен'),(56,49,'2017-01-24',110,'Заказ 1 - отменен'),(57,50,'2017-01-24',300,'Заказ 1 - отменен'),(58,52,'2017-01-24',240,'Заказ 1 - отменен'),(59,53,'2017-01-24',-580,'Заказ 1 - отгружен'),(60,54,'2017-01-24',-790,'Заказ 1 - отгружен'),(61,55,'2017-01-24',-680,'Заказ 1 - отгружен'),(62,56,'2017-01-24',-620,'Заказ 1 - отгружен'),(63,57,'2017-01-24',-900,'Заказ 1 - отгружен'),(64,51,'2017-01-24',-220,'Заказ 1 - отгружен'),(65,48,'2017-01-24',-120,'Заказ 1 - отгружен'),(66,49,'2017-01-24',-110,'Заказ 1 - отгружен'),(67,50,'2017-01-24',-300,'Заказ 1 - отгружен'),(68,52,'2017-01-24',-240,'Заказ 1 - отгружен'),(69,53,'2017-01-25',580,'Заказ 1 - отменен'),(70,54,'2017-01-25',790,'Заказ 1 - отменен'),(71,55,'2017-01-25',680,'Заказ 1 - отменен'),(72,56,'2017-01-25',620,'Заказ 1 - отменен'),(73,57,'2017-01-25',900,'Заказ 1 - отменен'),(74,51,'2017-01-25',220,'Заказ 1 - отменен'),(75,48,'2017-01-25',120,'Заказ 1 - отменен'),(76,49,'2017-01-25',110,'Заказ 1 - отменен'),(77,50,'2017-01-25',300,'Заказ 1 - отменен'),(78,52,'2017-01-25',240,'Заказ 1 - отменен'),(79,53,'2017-01-25',580,'Заказ 1 - отменен'),(80,54,'2017-01-25',790,'Заказ 1 - отменен'),(81,55,'2017-01-25',680,'Заказ 1 - отменен'),(82,56,'2017-01-25',620,'Заказ 1 - отменен'),(83,57,'2017-01-25',900,'Заказ 1 - отменен'),(84,51,'2017-01-25',220,'Заказ 1 - отменен'),(85,48,'2017-01-25',120,'Заказ 1 - отменен'),(86,49,'2017-01-25',110,'Заказ 1 - отменен'),(87,50,'2017-01-25',300,'Заказ 1 - отменен'),(88,52,'2017-01-25',240,'Заказ 1 - отменен'),(89,53,'2017-01-25',-580,'Заказ 1 - отгружен'),(90,54,'2017-01-25',-790,'Заказ 1 - отгружен'),(91,55,'2017-01-25',-680,'Заказ 1 - отгружен'),(92,56,'2017-01-25',-620,'Заказ 1 - отгружен'),(93,57,'2017-01-25',-900,'Заказ 1 - отгружен'),(94,51,'2017-01-25',-220,'Заказ 1 - отгружен'),(95,48,'2017-01-25',-120,'Заказ 1 - отгружен'),(96,49,'2017-01-25',-110,'Заказ 1 - отгружен'),(97,50,'2017-01-25',-300,'Заказ 1 - отгружен'),(98,52,'2017-01-25',-240,'Заказ 1 - отгружен'),(99,53,'2017-01-25',580,'Заказ 1 - отменен'),(100,54,'2017-01-25',790,'Заказ 1 - отменен'),(101,55,'2017-01-25',680,'Заказ 1 - отменен'),(102,56,'2017-01-25',620,'Заказ 1 - отменен'),(103,57,'2017-01-25',900,'Заказ 1 - отменен'),(104,51,'2017-01-25',220,'Заказ 1 - отменен'),(105,48,'2017-01-25',120,'Заказ 1 - отменен'),(106,49,'2017-01-25',110,'Заказ 1 - отменен'),(107,50,'2017-01-25',300,'Заказ 1 - отменен'),(108,52,'2017-01-25',240,'Заказ 1 - отменен'),(109,53,'2017-01-25',-580,'Заказ 1 - отгружен'),(110,54,'2017-01-25',-790,'Заказ 1 - отгружен'),(111,55,'2017-01-25',-680,'Заказ 1 - отгружен'),(112,56,'2017-01-25',-620,'Заказ 1 - отгружен'),(113,57,'2017-01-25',-900,'Заказ 1 - отгружен'),(114,51,'2017-01-25',-220,'Заказ 1 - отгружен'),(115,48,'2017-01-25',-120,'Заказ 1 - отгружен'),(116,49,'2017-01-25',-110,'Заказ 1 - отгружен'),(117,50,'2017-01-25',-300,'Заказ 1 - отгружен'),(118,52,'2017-01-25',-240,'Заказ 1 - отгружен'),(119,53,'2017-01-25',580,'Заказ 1 - отменен'),(120,54,'2017-01-25',790,'Заказ 1 - отменен'),(121,55,'2017-01-25',680,'Заказ 1 - отменен'),(122,56,'2017-01-25',620,'Заказ 1 - отменен'),(123,57,'2017-01-25',900,'Заказ 1 - отменен'),(124,51,'2017-01-25',220,'Заказ 1 - отменен'),(125,48,'2017-01-25',120,'Заказ 1 - отменен'),(126,49,'2017-01-25',110,'Заказ 1 - отменен'),(127,50,'2017-01-25',300,'Заказ 1 - отменен'),(128,52,'2017-01-25',240,'Заказ 1 - отменен'),(129,53,'2017-01-25',580,'Заказ 1 - отменен'),(130,54,'2017-01-25',790,'Заказ 1 - отменен'),(131,55,'2017-01-25',680,'Заказ 1 - отменен'),(132,56,'2017-01-25',620,'Заказ 1 - отменен'),(133,57,'2017-01-25',900,'Заказ 1 - отменен'),(134,51,'2017-01-25',220,'Заказ 1 - отменен'),(135,48,'2017-01-25',120,'Заказ 1 - отменен'),(136,49,'2017-01-25',110,'Заказ 1 - отменен'),(137,50,'2017-01-25',300,'Заказ 1 - отменен'),(138,52,'2017-01-25',240,'Заказ 1 - отменен'),(139,53,'2017-01-25',-580,'Заказ 1 - отгружен'),(140,54,'2017-01-25',-790,'Заказ 1 - отгружен'),(141,55,'2017-01-25',-680,'Заказ 1 - отгружен'),(142,56,'2017-01-25',-620,'Заказ 1 - отгружен'),(143,57,'2017-01-25',-900,'Заказ 1 - отгружен'),(144,51,'2017-01-25',-220,'Заказ 1 - отгружен'),(145,48,'2017-01-25',-120,'Заказ 1 - отгружен'),(146,49,'2017-01-25',-110,'Заказ 1 - отгружен'),(147,50,'2017-01-25',-300,'Заказ 1 - отгружен'),(148,52,'2017-01-25',-250,'Заказ 1 - отгружен'),(149,53,'2017-01-25',580,'Заказ 1 - отменен'),(150,54,'2017-01-25',790,'Заказ 1 - отменен'),(151,55,'2017-01-25',680,'Заказ 1 - отменен'),(152,56,'2017-01-25',620,'Заказ 1 - отменен'),(153,57,'2017-01-25',900,'Заказ 1 - отменен'),(154,51,'2017-01-25',220,'Заказ 1 - отменен'),(155,48,'2017-01-25',120,'Заказ 1 - отменен'),(156,49,'2017-01-25',110,'Заказ 1 - отменен'),(157,50,'2017-01-25',300,'Заказ 1 - отменен'),(158,52,'2017-01-25',250,'Заказ 1 - отменен'),(159,53,'2017-01-25',-580,'Заказ 1 - отгружен'),(160,54,'2017-01-25',-790,'Заказ 1 - отгружен'),(161,55,'2017-01-25',-680,'Заказ 1 - отгружен'),(162,56,'2017-01-25',-620,'Заказ 1 - отгружен'),(163,57,'2017-01-25',-900,'Заказ 1 - отгружен'),(164,51,'2017-01-25',-220,'Заказ 1 - отгружен'),(165,48,'2017-01-25',-120,'Заказ 1 - отгружен'),(166,49,'2017-01-25',-110,'Заказ 1 - отгружен'),(167,50,'2017-01-25',-300,'Заказ 1 - отгружен'),(168,52,'2017-01-25',-1000,'Заказ 1 - отгружен'),(169,53,'2017-01-25',580,'Заказ 1 - отменен'),(170,54,'2017-01-25',790,'Заказ 1 - отменен'),(171,55,'2017-01-25',680,'Заказ 1 - отменен'),(172,56,'2017-01-25',620,'Заказ 1 - отменен'),(173,57,'2017-01-25',900,'Заказ 1 - отменен'),(174,51,'2017-01-25',220,'Заказ 1 - отменен'),(175,48,'2017-01-25',120,'Заказ 1 - отменен'),(176,49,'2017-01-25',110,'Заказ 1 - отменен'),(177,50,'2017-01-25',300,'Заказ 1 - отменен'),(178,52,'2017-01-25',1000,'Заказ 1 - отменен'),(179,53,'2017-01-25',-580,'Заказ 1 - отгружен'),(180,54,'2017-01-25',-790,'Заказ 1 - отгружен'),(181,55,'2017-01-25',-680,'Заказ 1 - отгружен'),(182,56,'2017-01-25',-620,'Заказ 1 - отгружен'),(183,51,'2017-01-25',-220,'Заказ 1 - отгружен'),(184,48,'2017-01-25',-120,'Заказ 1 - отгружен'),(185,49,'2017-01-25',-110,'Заказ 1 - отгружен'),(186,50,'2017-01-25',-300,'Заказ 1 - отгружен'),(187,62,'2017-01-25',170,'26/1 - Принята пачка'),(188,64,'2017-01-25',170,'26/3 - Принята пачка'),(189,58,'2017-01-26',150,'25/1 - Принята пачка'),(190,59,'2017-01-26',150,'25/2 - Принята пачка'),(191,53,'2017-01-26',0,'27/1 - Изменено кол-во принятой пачки'),(192,54,'2017-01-26',160,'27/2 - Принята пачка'),(193,55,'2017-01-26',160,'27/3 - Принята пачка'),(194,57,'2017-01-26',160,'27/5 - Принята пачка'),(195,49,'2017-01-26',160,'27/8 - Принята пачка'),(196,64,'2017-02-05',-2,'26/3 - Изменено кол-во принятой пачки');
/*!40000 ALTER TABLE `transaction_records_warehouse` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2017-03-07 22:27:29
